{
    "educations": [
        {
            "id": "edu-1",
            "school": "The Hong Kong University of Science and Technology",
            "degree": "Bachelor's Degree in Computer Science",
            "duration": "Aug 2011 - Aug 2015",
            "content": [
                "GPA: 3.8",
                "Courses: Software Engineering, Distributed Systems, Operating Systems, Advanced Algorithms, Experience Design"
            ]
        }
    ],
    "experiences": [
        {
            "id": "exp-1",
            "company": "Alten Technology USA",
            "position": "Senior Fullstack Engineer",
            "duration": "Mar 2020 - Present",
            "description": [
                "Implemented a notification system using AWS services, resulting in a 19% increase in customer satisfaction.",
                "Achieved 80% augment of customer’s analysis architecting CMS using D3.js.",
                "Leveraged web scrapping to ensure the minimum progress by 10%.",
                "Executed a microservices architecture using Docker and Kubernetes to improve the scalability and maintainability of a complex web application by 120%.",
                "Realized Jest, and Cypress in TDD, achieving a test coverage of 90%.",
                "Led the team of 5 engineers and conducted +2 reviews daily to ensure reliable and high-quality coding practices resulting in a 30% reduction in bugs and overall improvement in code quality."
            ]
        },
        {
            "id": "exp-2",
            "company": "Toptal",
            "position": "Senior Fullstack Engineer",
            "duration": "Mar 2017 - Mar 2020",
            "description": [
                "Developed a highly scalable e-commerce platform that can handle 1M transactions per day using React, Node.js, Express.js, MongoDB, Redis, and AWS.",
                "Improved customer understanding of complex3D models by 20% using Three.js.",
                "Built a Stripe payment processing and inventory management microservice utilizing Node.js and AWS Lambda, reducing payment processing time by 30% and increasing successful transactions by 20%.",
                "Demonstrated strong problem-solving skills and the ability to resolve technical issues in a team setting, resulting in a 20% reduction in post-release bugs."
            ]
        },
        {
            "id": "exp-3",
            "company": "Netradyne",
            "position": "Fullstack Engineer",
            "duration": "Jun 2015 - Mar 2017",
            "description": [
                "Built pixel-perfect, mobile-first, and interactive components resulting in a 35% increase in user satisfaction.",
                "Applied complex frontend features such as optimizing performance resulting in a 30% improvement in website loading time and a 15% increase in accessibility compliance score.",
                "Communicated technical concepts and project status updates clearly and effectively to non-technical stakeholders, resulting in a 15% increase in stakeholder satisfaction."
            ]
        }
    ],
    "skills": [
        {
            "title": "Programming",
            "tools": [
                "TypeScript",
                "JavaScript",
                "Python",
                "C/C++",
                "C#",
                "Java",
                "NoSQL",
                "SQL",
                "React Native",
                "D3.js"
            ]
        },
        {
            "title": "Frontend",
            "tools": ["React", "Angular 11", "Vue", "Next"]
        },
        {
            "title": "Backend",
            "tools": ["Node.js", "Python", "Java", "Go"]
        },

        {
            "title": "AWS services",
            "tools": ["AWS Lambda", "EC2", "S3", "DynamoDB"]
        },
        {
            "title": "Deploy",
            "tools": ["CI/CD pipeline", "Github Actions", "Jenkins"]
        },
        {
            "title": "Containerization",
            "tools": ["Docker", "Kubernetes"]
        },
        {
            "title": "Other",
            "tools": ["Artificial Intelligence", "Machine Learning"]
        }
    ],
    "blog": [
        {
            "id": "blog-1",
            "title": "A beginner's guide to github",
            "link": ""
        },
        {
            "id": "blog-2",
            "title": "User Experience Design – A little more than just design",
            "link": ""
        }
    ]
}
