{
    "educations": [
        {
            "id": "edu-1",
            "school": "The Hong Kong University of Science and Technology",
            "degree": "Bachelor's Degree in Computer Science",
            "duration": "Aug 2011 - Aug 2015",
            "content": [
                "GPA: 3.8",
                "Courses: Software Engineering, Distributed Systems, Operating Systems, Advanced Algorithms, Experience Design"
            ]
        }
    ],
    "experiences": [
        {
            "id": "exp-1",
            "company": "Kforce",
            "position": "Senior Fullstack Engineer",
            "duration": "Mar 2020 - Present",
            "description": [
                "Built pixel-perfect, responsive, user-friendly websites using React, Next.js, React Hooks, Redux, TypeScript to increase user experience by 20%.",
                "Improved efficiency of the platform to 150% by building microservices serverless architecture with Node.js, TypeScript, AWS Lambda, EC2, DynamoDB, SNS, SQS, API Gateway and AppSync.",
                "Implemented smooth connection between Figma and Amplify, Amplify and Next.js so that reduced efforts 50% to adapt style with CSS to React components.",
                "Transitioned WordPress into modern architecture with microservices using React, Node.js and AWS.",
                "Increased API security 30% by implementing authentication providers like Oauth, Okta, JWT and AWS Cognito.",
                "Took ownership of the entire project and consistently identified and resolved performance bottlenecks and critical bugs utilizing New Relic, DataDog and AWS CloudWatch.",
                "Leveraged web scrapping libraries including Selenium and Puppeteer to automate the progress and decrease the manual progress by 70%.",
                "Orchestrated seamless application deployments through cutting-edge techniques such as Kubernetes, Docker and AWS EKS by harnessing the power of containerization and accelerated deployment speed preserving the impeccable level of availability.",
                "Utilized Python locust for load testing to ensure the successful working without laggy between the cache and master DB.",
                "Cooperated closely with cross-functional teams, including product managers, UI/UX designers, and QA engineers, to gather requirements, prioritize features, and deliver a robust and visually appealing online shopping platform.",
                "Led a team of 5 engineers and provided mentorship to junior developers by offering technical guidance, conducting +4 reviews every day, and assisting with the development of a complex software application’s backend."
            ]
        },
        {
            "id": "exp-2",
            "company": "Toptal",
            "position": "Senior Fullstack Engineer",
            "duration": "Mar 2017 - Mar 2020",
            "description": [
                "Developed responsive, cross-browser-compatible, high-performance web pages & and mobile screens using React, React Native, SASS, and Material UI.",
                "Innovated a new user interface using stunning 3D models that enhanced the overall shopping experience and increased user engagement by 19% based on Three.js.",
                "Achieved 80% augment of customer’s analysis architecting admin dashboard using data visualization tools like D3.js.",
                "Wrote comprehensive tests, including unit testing using Jest + Enzyme, and end-to-end testing using Cypress, achieving 80% test coverage.",
                "Played a key role in bridging communication gaps between offshore development teams and crossfunctional departments, such as product, design, and marketing, ensuring the seamless and timely delivery of numerous high-impact features."
            ]
        },
        {
            "id": "exp-3",
            "company": "Netradyne",
            "position": "Fullstack Engineer",
            "duration": "Jun 2015 - Mar 2017",
            "description": [
                "Assisted in implementing pixel-perfect, mobile-first, responsive user interfaces, resulting in a 15% increase in mobile user engagement.",
                "Partnered with design and QA teams to develop visually appealing UI elements using JavaScript, jQuery, HTML, and CSS.",
                "Utilized SVG, Canvas and CSS animations to implement particle effects on the frontend to increase user experience."
            ]
        }
    ],
    "skills": [
        {
            "title": "Programming",
            "tools": [
                "TypeScript",
                "JavaScript",
                "Python",
                "C/C++",
                "C#",
                "Java",
                "NoSQL",
                "SQL",
                "React Native",
                "D3.js"
            ]
        },
        {
            "title": "Frontend",
            "tools": ["React", "Angular 11", "Vue", "Next"]
        },
        {
            "title": "Backend",
            "tools": ["Node.js", "Python", "Java", "Go"]
        },

        {
            "title": "AWS services",
            "tools": ["AWS Lambda", "EC2", "S3", "DynamoDB"]
        },
        {
            "title": "Deploy",
            "tools": ["CI/CD pipeline", "Github Actions", "Jenkins"]
        },
        {
            "title": "Containerization",
            "tools": ["Docker", "Kubernetes"]
        },
        {
            "title": "Other",
            "tools": ["Artificial Intelligence", "Machine Learning"]
        }
    ],
    "blog": [
        {
            "id": "blog-1",
            "title": "A beginner's guide to github",
            "link": ""
        },
        {
            "id": "blog-2",
            "title": "User Experience Design – A little more than just design",
            "link": ""
        }
    ]
}
